Repository: rev2023/Internship-Tasks
Catalog: lib/l10n/app_*.arb
Languages: es

# count
source: Number of times button is clicked: {count}
es: Veces pulsado: {count}

# appbar
source: Counter App
es: Aplicación de Contador

source: Increase ++
es: Aumentar ++

source: Decrease --
es: Disminuir --

source: Reset
es: Reiniciar

# error
source: Error: Cannot decrement below 0
es: Error: No se puede decrementar por debajo de 0

source: Home
es: Inicio

source: Cards
es: Tarjetas

source: Settings
es: Ajustes

source: Appearance
es: Apariencia

source: About
es: Acerca de

# select
source: Select theme mode
es: Seleccionar modo de tema

source: Light
es: Claro

source: Dark
es: Oscuro

source: Fire Red
es: Rojo Fuego

source: Leaf Green
es: Verde Hoja

# preferences
source: Select preferred language
es: Seleccionar idioma preferido

# preferencesOption
source: Preferences
es: Preferencias

# fact0_0
source: The concept of zero as a number was first developed by ancient civilizations such as the Babylonians and Mayans. However, it was the Indian mathematicians who introduced the digit "0"
es: El concepto de cero como número fue desarrollado por antiguas civilizaciones como los babilonios y mayas. Sin embargo, fueron los matemáticos indios quienes introdujeron el dígito "0".

# fact0_1
source: In many spiritual and philosophical traditions, the number 0 symbolizes potential, nothingness, or infinity.
es: En muchas tradiciones espirituales y filosóficas, el número 0 simboliza el potencial, la nada o el infinito.

# fact0_2
source: The number 0 has significant importance in mathematics. It serves as the identity element for addition and subtraction, meaning that adding or subtracting 0 from a number leaves the number unchanged.
es: El número 0 tiene una importancia significativa en las matemáticas. Sirve como elemento identidad para la suma y resta, lo que significa que sumar o restar 0 a un número deja el número sin cambios.

# fact1_0
source: The number 1 is the first natural number.
es: El número 1 es el primer número natural.

# fact1_1
source: In binary, the number 1 is represented as 1.
es: En binario, el número 1 se representa como 1.

# fact1_2
source: In Roman numerals, the number 1 is represented as I.
es: En números romanos, el número 1 se representa como I.

# fact1_3
source: One is the loneliest number, according to the popular song.
es: Uno es el número más solitario, según la popular canción.

# fact2_0
source: The number 2 is the only even prime number.
es: El número 2 es el único número primo par.

# fact2_1
source: In binary, the number 2 is represented as 10.
es: En binario, el número 2 se representa como 10.

# fact2_2
source: The number 2 is the base of the binary number system.
es: El número 2 es la base del sistema numérico binario.

# fact2_3
source: Two is better than one, as the saying goes.
es: Dos es mejor que uno, como dice el refrán.

# fact3_0
source: The number 3 is the first odd prime number.
es: El número 3 es el primer número primo impar.

# fact3_1
source: In binary, the number 3 is represented as 11.
es: En binario, el número 3 se representa como 11.

# fact3_2
source: The number 3 is considered a mystical number in many cultures.
es: El número 3 se considera un número místico en muchas culturas.

# fact3_3
source: Third time's the charm, as they say.
es: A la tercera va la vencida, como se dice.

# fact4_0
source: The number 4 is the smallest composite number.
es: El número 4 es el número compuesto más pequeño.

# fact4_1
source: In binary, the number 4 is represented as 100.
es: En binario, el número 4 se representa como 100.

# fact4_2
source: There are four suits in a standard deck of playing cards.
es: Hay cuatro palos en una baraja de cartas estándar.

# fact4_3
source: Four-leaf clovers are considered lucky.
es: Los tréboles de cuatro hojas se consideran de buena suerte.

# fact5_0
source: The number 5 is the fifth natural number.
es: El número 5 es el quinto número natural.

# fact5_1
source: In binary, the number 5 is represented as 101.
es: En binario, el número 5 se representa como 101.

# fact5_2
source: The number 5 is a common choice for jersey numbers in sports.
es: El número 5 es una elección común para los números de camiseta en los deportes.

# fact5_3
source: High five! A gesture of celebration or congratulations.
es: ¡Choca esos cinco! Un gesto de celebración o felicitación.

# fact6_0
source: The number 6 is a highly composite number.
es: El número 6 es un número altamente compuesto.

# fact6_1
source: In binary, the number 6 is represented as 110.
es: En binario, el número 6 se representa como 110.

# fact6_2
source: The number 6 is associated with harmony and balance in many cultures.
es: El número 6 está asociado con la armonía y el equilibrio en muchas culturas.

# fact6_3
source: The sixth sense refers to an intuitive or psychic ability.
es: El sexto sentido se refiere a una habilidad intuitiva o psíquica.

# fact7_0
source: The number 7 is a prime number.
es: El número 7 es un número primo.

# fact7_1
source: In binary, the number 7 is represented as 111.
es: En binario, el número 7 se representa como 111.

# fact7_2
source: There are seven days in a week.
es: Hay siete días en una semana.

# fact7_3
source: Lucky number 7 is often associated with good fortune.
es: El número 7 de la suerte está asociado con la buena fortuna.

# fact8_0
source: The number 8 is the cube of 2.
es: El número 8 es el cubo de 2.

# fact8_1
source: In binary, the number 8 is represented as 1000.
es: En binario, el número 8 se representa como 1000.

# fact8_2
source: There are eight bits in a byte.
es: Hay ocho bits en un byte.

# fact8_3
source: Eight is considered a lucky number in Chinese culture.
es: El número ocho se considera un número de la suerte en la cultura china.

# fact9_0
source: The number 9 is a square number.
es: El número 9 es un número cuadrado.

# fact9_1
source: In binary, the number 9 is represented as 1001.
es: En binario, el número 9 se representa como 1001.

# fact9_2
source: In many cultures, the number 9 is associated with spirituality.
es: En muchas culturas, el número 9 está asociado con la espiritualidad.

# fact9_3
source: Nine lives are often attributed to cats.
es: Se atribuyen nueve vidas a menudo a los gatos.

# fact10_0
source: The number 10 is the base of the decimal number system.
es: El número 10 es la base del sistema numérico decimal.

# fact10_1
source: In binary, the number 10 is represented as 1010.
es: En binario, el número 10 se representa como 1010.

# fact10_2
source: There are ten fingers and ten toes on a human body.
es: Hay diez dedos en las manos y diez dedos en los pies en el cuerpo humano.

# fact10_3
source: Ten is a common milestone age for children.
es: Diez es una edad comúnmente destacada para los niños.

# fact11_0
source: The number 11 is a prime number.
es: El número 11 es un número primo.

# fact11_1
source: In binary, the number 11 is represented as 1011.
es: En binario, el número 11 se representa como 1011.

# fact11_2
source: In numerology, the number 11 is considered a master number.
es: En numerología, el número 11 se considera un número maestro.

# fact11_3
source: Eleven players are usually on a football (soccer) team.
es: En general, un equipo de fútbol (fútbol) tiene once jugadores.

# fact12_0
source: The number 12 is highly divisible.
es: El número 12 es altamente divisible.

# fact12_1
source: In binary, the number 12 is represented as 1100.
es: En binario, el número 12 se representa como 1100.

# fact12_2
source: There are twelve months in a year.
es: Hay doce meses en un año.

# fact12_3
source: Twelve is often associated with completeness or perfection.
es: El número 12 a menudo se asocia con la completitud o perfección.

# fact13_0
source: The number 13 is considered unlucky in many cultures.
es: El número 13 se considera de mala suerte en muchas culturas.

# fact13_1
source: In binary, the number 13 is represented as 1101.
es: En binario, el número 13 se representa como 1101.

# fact13_2
source: There are thirteen stripes on the United States flag.
es: Hay trece franjas en la bandera de los Estados Unidos.

# fact13_3
source: Friday the 13th is considered an unlucky day.
es: El viernes 13 se considera un día de mala suerte.

# fact14_0
source: The number 14 is a composite number.
es: El número 14 es un número compuesto.

# fact14_1
source: In binary, the number 14 is represented as 1110.
es: En binario, el número 14 se representa como 1110.

# fact14_2
source: There are fourteen stations of the Cross in Christianity.
es: Hay catorce estaciones del Vía Crucis en el cristianismo.

# fact14_3
source: Fourteen is the atomic number of silicon.
es: El catorce es el número atómico del silicio.

# fact15_0
source: The number 15 is a triangular number.
es: El número 15 es un número triangular.

# fact15_1
source: In binary, the number 15 is represented as 1111.
es: En binario, el número 15 se representa como 1111.

# fact15_2
source: There are fifteen players on a rugby union team.
es: Hay quince jugadores en un equipo de rugby.

# fact15_3
source: Fifteen is the age of eligibility for a driver's permit in many countries.
es: Quince años es la edad para obtener un permiso de conducir en muchos países.
